Tekla Open API Reference for Tekla Structures 2025
Projection Methods
The Projection type exposes the following members.
Methods
Name | Description
LineSegmentToPlane
 Returns a new line segment which is a projection of the given line segment onto the given plane.
LineToPlane
 Returns a new line which is a projection of the given line onto the given plane.
PointToLine
 Returns a new point which is a projection of the given point onto the given line.
PointToPlane
 Returns a new point which is a projection of the given point onto the given plane.
Top
See Also
Reference
Projection Class
Tekla.Structures.Geometry3d Namespace